In [193]:
import pandas as pd
df=pd.read_csv("persona.csv")

In [194]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB

Soru 2: Kaç unique SOURCE vardır? Frekansları nedir?

In [195]:
df.nunique()

PRICE       6
SOURCE      2
SEX         2
COUNTRY     6
AGE        46
dtype: int64

Soru 3:Kaç unique PRICE vardır?

In [196]:
df["PRICE"].nunique()

6

Soru 4:Hangi PRICE'dan kaçar tane satış gerçekleşmiş?

In [197]:
df["PRICE"].value_counts()

29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: PRICE, dtype: int64

Soru 5:Hangi ülkeden kaçar tane satış olmuş?

In [198]:
df["COUNTRY"].value_counts()

usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: COUNTRY, dtype: int64

Soru 6:Ülkelere göre satışlardan toplam ne kadar kazanılmış?

In [199]:
df["COUNTRY"].value_counts().sum()

5000

Soru 7:SOURCE türlerine göre satış sayıları nedir?

In [200]:
df["SOURCE"].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

Soru 8:Ülkelere göre PRICE ortalamaları nedir?

In [201]:
df.groupby("COUNTRY")["PRICE"].mean()

COUNTRY
bra    34.327540
can    33.608696
deu    34.032967
fra    33.587459
tur    34.787140
usa    34.007264
Name: PRICE, dtype: float64

SORU 9:SOURCE'lara göre PRICE ortalamaları nedir?

In [202]:
df.groupby("SOURCE")["PRICE"].mean()

SOURCE
android    34.174849
ios        34.069102
Name: PRICE, dtype: float64

Soru 10: COUNTRY-SOURCE kırılımında PRICE ortalamaları nedir?

In [203]:
df.groupby(["SOURCE","COUNTRY"])["PRICE"].mean()

SOURCE   COUNTRY
android  bra        34.387029
         can        33.330709
         deu        33.869888
         fra        34.312500
         tur        36.229437
         usa        33.760357
ios      bra        34.222222
         can        33.951456
         deu        34.268817
         fra        32.776224
         tur        33.272727
         usa        34.371703
Name: PRICE, dtype: float64

Görev 2:  COUNTRY, SOURCE, SEX, AGE kırılımında ortalama kazançlar nedir?

In [204]:
df.groupby(["COUNTRY","SOURCE","SEX","AGE"]).agg({"PRICE":"mean"})

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
...                               ...
usa     ios     male   42   30.250000
                       50   39.000000
                       53   34.000000
                       55   29.000000
                       59   46.500000

[348 rows x 1 columns]

Önceki sorudaki çıktıyı daha iyi görebilmek için sort_values metodunu azalan olacak şekilde PRICE’agöre uygulayınız. Çıktıyı agg_df olarak kaydediniz.

In [205]:
agg_df=df.groupby(["COUNTRY","SOURCE","SEX","AGE"]).agg({"PRICE":'mean'})
agg_df.sort_values('PRICE', ascending=False)

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0
...                           ...
usa     ios     female 38    19.0
                       30    19.0
can     android female 27    19.0
fra     android male   18    19.0
deu     android male   26     9.0

[348 rows x 1 columns]

Görev 4:  Indekste yer alan isimleri değişken ismine çeviriniz. Üçüncü sorunun çıktısında yer alan PRICE dışındaki tüm değişkenler indexisimleridir. Bu isimleri değişken isimlerine çeviriniz.

In [206]:
agg_df=agg_df.reset_index()
agg_df.columns

Index(['COUNTRY', 'SOURCE', 'SEX', 'AGE', 'PRICE'], dtype='object')

Görev 5:  Age değişkenini kategorik değişkene çeviriniz ve agg_df’eekleyiniz. Aralıkları ikna edici şekilde oluşturunuz. Örneğin: ‘0_18', ‘19_23', '24_30', '31_40', '41_70'

In [207]:
my_bins=[0,18,23,30,40, agg_df["AGE"].max()]
mylabels=['0_18', '19_23', '24_30', '31_40', '41_'+str(agg_df["AGE"].max())]
agg_df['AGE_CAT']=pd.cut(agg_df['AGE'],bins=my_bins,labels=mylabels)
agg_df

    COUNTRY   SOURCE     SEX  AGE      PRICE AGE_CAT
0       bra  android  female   15  38.714286    0_18
1       bra  android  female   16  35.944444    0_18
2       bra  android  female   17  35.666667    0_18
3       bra  android  female   18  32.255814    0_18
4       bra  android  female   19  35.206897   19_23
..      ...      ...     ...  ...        ...     ...
343     usa      ios    male   42  30.250000   41_66
344     usa      ios    male   50  39.000000   41_66
345     usa      ios    male   53  34.000000   41_66
346     usa      ios    male   55  29.000000   41_66
347     usa      ios    male   59  46.500000   41_66

[348 rows x 6 columns]

Görev 6:Yeni seviye tabanlı müşterileri (persona) tanımlayınız ve veri setine değişken olarak ekleyiniz.Yeni eklenecek değişkenin adı: customers_level_based. Önceki soruda elde edeceğiniz çıktıdaki gözlemleri bir araya getirerek customers_level_baseddeğişkenini oluşturmanız gerekmektedir.

In [208]:
agg_df["CUSTOMERS_LEVEL_BASED"] = ["_".join(i).upper() for i in agg_df.drop(['AGE', 'PRICE'], axis=1).values]
agg_df

    COUNTRY   SOURCE     SEX  AGE      PRICE AGE_CAT     CUSTOMERS_LEVEL_BASED
0       bra  android  female   15  38.714286    0_18   BRA_ANDROID_FEMALE_0_18
1       bra  android  female   16  35.944444    0_18   BRA_ANDROID_FEMALE_0_18
2       bra  android  female   17  35.666667    0_18   BRA_ANDROID_FEMALE_0_18
3       bra  android  female   18  32.255814    0_18   BRA_ANDROID_FEMALE_0_18
4       bra  android  female   19  35.206897   19_23  BRA_ANDROID_FEMALE_19_23
..      ...      ...     ...  ...        ...     ...                       ...
343     usa      ios    male   42  30.250000   41_66        USA_IOS_MALE_41_66
344     usa      ios    male   50  39.000000   41_66        USA_IOS_MALE_41_66
345     usa      ios    male   53  34.000000   41_66        USA_IOS_MALE_41_66
346     usa      ios    male   55  29.000000   41_66        USA_IOS_MALE_41_66
347     usa      ios    male   59  46.500000   41_66        USA_IOS_MALE_41_66

[348 rows x 7 columns]

In [209]:
agg_df=agg_df[["CUSTOMERS_LEVEL_BASED","PRICE"]]

In [210]:
agg_df

        CUSTOMERS_LEVEL_BASED      PRICE
0     BRA_ANDROID_FEMALE_0_18  38.714286
1     BRA_ANDROID_FEMALE_0_18  35.944444
2     BRA_ANDROID_FEMALE_0_18  35.666667
3     BRA_ANDROID_FEMALE_0_18  32.255814
4    BRA_ANDROID_FEMALE_19_23  35.206897
..                        ...        ...
343        USA_IOS_MALE_41_66  30.250000
344        USA_IOS_MALE_41_66  39.000000
345        USA_IOS_MALE_41_66  34.000000
346        USA_IOS_MALE_41_66  29.000000
347        USA_IOS_MALE_41_66  46.500000

[348 rows x 2 columns]

In [212]:
agg_df=agg_df.groupby("CUSTOMERS_LEVEL_BASED")["PRICE"].mean().reset_index()

Görev 7:  Yeni müşterileri (personaları) segmentlere ayırınız.•,Yeni müşterileri (Örnek: USA_ANDROID_MALE_0_18) PRICE’a göre 4 segmente ayırınız.Segmentleri SEGMENT isimlendirmesi ile değişken olarak agg_df’e ekleyiniz.Segmentleri betimleyiniz (Segmentlere göre groupby yapıp price mean, max, sum’larını alınız).

In [213]:
agg_df['SEGMENT'] = pd.qcut(agg_df.PRICE, q=4, labels=['D', 'C', 'B','A'])
agg_df.head()

      CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
0   BRA_ANDROID_FEMALE_0_18  35.645303       B
1  BRA_ANDROID_FEMALE_19_23  34.077340       C
2  BRA_ANDROID_FEMALE_24_30  33.863946       C
3  BRA_ANDROID_FEMALE_31_40  34.898326       B
4  BRA_ANDROID_FEMALE_41_66  36.737179       A

In [214]:
agg_df.groupby('SEGMENT').agg({'PRICE': ['mean',"sum","max","min"]}).reset_index()

  SEGMENT      PRICE
                mean          sum        max        min
0       D  29.206780   817.789833  32.333333  19.000000
1       C  33.509674   904.761209  34.077340  32.500000
2       B  34.999645   944.990411  36.000000  34.103727
3       A  38.691234  1044.663328  45.428571  36.060606

Görev 8:  Yeni gelen müşterileri sınıflandırıp, ne kadar gelir getirebileceklerini  tahmin ediniz.
•33 yaşında ANDROID kullanan bir Türk kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?
•35 yaşında IOS kullanan bir Fransız kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?

In [215]:
new_user="TUR_ANDROID_FEMALE_31_40"
agg_df[agg_df["CUSTOMERS_LEVEL_BASED"]==new_user]

       CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
72  TUR_ANDROID_FEMALE_31_40  41.833333       A

In [216]:
new_user = 'FRA_IOS_FEMALE_31_40'
agg_df[agg_df['CUSTOMERS_LEVEL_BASED'] == new_user]

   CUSTOMERS_LEVEL_BASED      PRICE SEGMENT
63  FRA_IOS_FEMALE_31_40  32.818182       C